Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The Project API
zh_cn: Project API

source: The Project API also provides a property for accessing the subprojects only.
zh_cn: Project API 还提供了一个属性只用于访问子项目。

source: The Project API provides a method called project(), which takes a path as an argument and returns the Project object for this path.
zh_cn: Project API 提供了一个叫做project()的方法，它将路径作为参数，返回此路径的Project 对象。

source: The Project API provides a property allprojects which returns a list with the current project and all its subprojects underneath it.
zh_cn: Project API 提供了一个allprojects 属性，它返回一个当前项目的list，该项目的所有子项目都在这个list中。

source: The Project report plugin adds some tasks to your project which generate reports containing useful information about your build.
zh_cn: 项目报告插件将一些任务添加到项目中，用于生成包含有关构建的有用信息的报告。

source: The Resin servlet container allows us, to let such a distribution point to a base installation of the servlet container.
zh_cn: Resin servlet 容器能允许我们让这样的一个分发指向一个基本安装的servlet容器中。

source: The Scala Plugin
zh_cn: Scala 插件

source: The Scala plugin adds a configuration named zinc to resolve the Zinc library and its dependencies.
zh_cn: Scala 插件添加了一个名为zinc的配置，以解析 Zinc 库及其依赖。

source: The Scala plugin adds the following convention properties to each source set in the project.
zh_cn: Scala 的插件向 project 的每一个source set 添加了下列的公约属性。

source: The Scala plugin adds the following dependencies to tasks added by the Java plugin.
zh_cn: Scala 插件向 Java 插件所加入的 tasks 添加了以下的依赖。

source: The Scala plugin adds the following tasks to the project.
zh_cn: Scala 的插件向project 中添加了以下任务。

source: The Scala plugin also modifies some source set properties:
zh_cn: Scala 的插件还修改了一些 source set 的属性：

source: The Scala plugin assumes the project layout shown below.
zh_cn: Scala 插件会假定如下所示的项目布局。

source: The Scala plugin does not add any convention properties to the project.
zh_cn: Scala 插件没有向 project 添加任何的公约属性。

source: The Scala plugin extends the Java plugin to add support for Scala projects.
zh_cn: Scala 的插件继承自 Java 插件并添加了对 Scala 项目的支持。

source: The Scala plugin includes support for fsc, the Fast Scala Compiler.
zh_cn: Scala 插件包含了对fsc，即 Fast Scala Compiler 的支持。

source: The Scala plugin now supports incremental compilation by integrating with Zinc, a standalone version of sbt's incremental Scala compiler.
zh_cn: Scala 插件现在通过集成 Zinc 来支持增量编译， 它是sbt增量 Scala 编译器的一个单机版本。

source: The Scala source files of this source set.
zh_cn: 该source set 中的 Scala 源文件。

source: The Script API
zh_cn: Script API

source: The Setup tab allows configuration of some general settings.
zh_cn: 设置（Setup）选项卡允许你配置一些常规的设置。

source: The Signing plugin provides a DSL that allows you to specify the tasks and/or configurations that should be signed.
zh_cn: Signing 插件提供了一个DSL，它允许你指定应签名的任务及配置。

source: The Sonar Runner is capable of analyzing whole project hierarchies at once.
zh_cn: Sonar Runner 插件能够一次分析整个项目的层次结构。

source: The Sonar Runner plugin adds a SonarRunner extension to the project, which allows to configure the Sonar Runner via key/value pairs known as Sonar properties.
zh_cn: Sonar Runner 插件向 project 添加了一个 SonarRunner扩展，它允许通过被称为 Sonar 属性 的键/值对配置 Sonar Runner。

source: The Sonar Runner plugin adds the following tasks to the project.
zh_cn: Sonar Runner插件向 project 中添加了以下任务。

source: The Sonar Runner plugin is the successor to the Sonar Plugin.
zh_cn: Sonar Runner 插件是Sonar 插件的继任者。

source: The Sonar Runner plugin leverages information contained in Gradle's object model to provide smart defaults for many of the standard Sonar properties.
zh_cn: Sonar Runner 插件利用 Gradle 的对象模型所包含的信息，提供了许多标准的 Sonar 属性的智能默认值。

source: The Sonar Runner plugin provides integration with Sonar, a web-based platform for monitoring code quality.
zh_cn: Sonar Runner 插件提供了对 Sonar，一个基于 web 的代码质量监测平台的集成。

source: The Sonar plugin adds the following tasks to the project.
zh_cn: Sonar 插件向project 中添加了以下任务。

source: The Sonar plugin is capable of analyzing a whole project hierarchy at once.
zh_cn: Sonar 插件能够一次分析整个项目的层次结构。

source: The Sonar plugin offers hooks to post-process Sonar properties before they get passed to the code analyzer.
zh_cn: Sonar 插件提供了hooks，用于 Sonar 属性传给代码分析器前的后置处理。

source: The Sonar plugin provides integration with Sonar, a web-based platform for monitoring code quality.
zh_cn: Sonar 插件提供了对 Sonar，一个基于 web 的代码质量监测平台的集成。

source: The Sonar runner plugin is currently incubating.
zh_cn: Sonar runner 插件是目前仍是孵化状态。

source: The String parameter is used as a description for the rule.
zh_cn: 这个字符串参数被用作这条规则的描述。

source: The TCP port which Jetty should listen for HTTP requests on.
zh_cn: Jetty 监听 HTTP 请求的 TCP 端口。

source: The TCP port which Jetty should listen for admin requests on.
zh_cn: Jetty 监听 admin 请求的 TCP 端口。

source: The Task Tree context menu provides the following options:
zh_cn: 任务树的上下文菜单会提供以下选项：

source: The Task Tree shows a hierarchical display of all projects and their tasks.
zh_cn: 任务树显示了所有项目和它们的任务的层次结构。

source: The TestNG framework has a quite similar concept.
zh_cn: TestNG 框架有一个非常相似的概念。

source: The Tooling API (see Chapter 62, Embedding Gradle) uses the daemon all the time, e.g. you cannot officially use the Tooling API without the daemon.
zh_cn: Tooling API (参见 第六十二章， 嵌入 Gradle ) 在整个过程当中都使用守护进程。如，你无法在没有守护进程时正式地使用 Tooling API。

source: The UI displays 4 tabs along the top and an output window along the bottom.
zh_cn: 在Gradle的用户界面（UI）中，上面是4个选项卡，下面则是输出窗口。

source: The War Plugin
zh_cn: War 插件

source: The War plugin adds the following dependencies to tasks added by the Java plugin.
zh_cn: War 插件向 Java 插件所加入的 tasks 添加了以下的依赖。

source: The War plugin adds the following tasks to the project.
zh_cn: War 插件向project 中添加了以下任务。

source: The War plugin adds two dependency configurations: providedCompile and providedRuntime.
zh_cn: War 插件添加了两个依赖配置： providedCompile和providedRuntime。

source: The War plugin extends the Java plugin to add support for assembling web application WAR files.
zh_cn: War 的插件继承自 Java 插件并添加了对组装 web 应用程序的 WAR 文件的支持。

source: The War plugin extends the Java plugin to build a WAR file for your project.
zh_cn: War插件扩展了Java插件来为你的项目构建WAR文件。

source: The Zinc based compiler (scalaCompileOptions.useAnt = false) will leverage the Gradle compiler daemon, and does so by default.
zh_cn: 基于 Zinc 的编译器 (scalaCompileOptions.useAnt = false) 将利用 Gradle 编译器守护进程，且默认情况下也是这样。

source: The ability to execute the Sonar Runner via a regular Gradle task makes it available anywhere Gradle is available (developer build, CI server, etc.), without the need to download, setup, and maintain a Sonar Runner installation.
zh_cn: 可以通过一个正规的 Gradle 任务来执行 Sonar Runner，这使得在任何 Gradle 可用的地方，它都可以用（开发人员构建，CI 服务器等），而无需下载，安装，和维护 Sonar Runner 的安装。

source: The absolute path of the generated archive.
zh_cn: 生成的归档文件的绝对路径。

source: The absolute path of the project.
zh_cn: 项目的绝对路径。

source: The absolute path to the secret key ring file containing your private key.
zh_cn: 指向包含了你的私钥的密钥环文件的绝对路径。

source: The appendix portion of the archive file name.
zh_cn: 归档文件的名称中的附录部分。

source: The application deployment location within the Jetty container.
zh_cn: 在 Jetty 容器里面的应用程序部署位置。

source: The application of plugins is idempotent.
zh_cn: 插件的应用是幂等的。

source: The application plugin adds some properties to the project, which you can use to configure its behaviour.
zh_cn: 该应用程序插件将一些属性添加到 project 中，以用于配置其行为。

source: The appropriate groovy libraries will be added to the WAR file for you.
zh_cn: 它将为你把适当的groovy库添加到WAR文件中。

source: The archive tasks all work exactly the same way as the Copy task, and implement the same CopySpec interface.
zh_cn: 归档任务与Copy任务的工作方式一样，并且实现了相同的CopySpec接口。

source: The attributes of the Ant task are passed as Map parameters to the method.
zh_cn: Ant 任务的属性会作为 Map 参数传给该方法。

source: The auto search for a settings file does only work for multi-project builds with a physical hierarchical or flat layout.
zh_cn: 自动搜索设置文件只适合具有物理上的层次结构或平面的布局的多项目构建。

source: The available protocols and the corresponding libraries are listed in Table 52.3, “Protocol jars for Maven deployment” (those libraries have again transitive dependencies which have transitive dependencies).
zh_cn: 表 52.3. “Maven 部署的协议jar”列出了可用的协议以及相应的库（这些库又有具有传递依赖，而这些依赖也有其自己的传递依赖）。

source: The base file name of the generated archive
zh_cn: 生成的归档文件的基本文件名

source: The base name portion of the archive file name.
zh_cn: 归档文件的名称中的基本名称部分。

source: The basename to use for archives, such as JAR or ZIP files.
zh_cn: 像JAR或ZIP文件这样的构件的basename

source: The basic idea is that the gradle command forks a daemon process, which performs the actual build.
zh_cn: 基本的思想是， gradle 命令会fork一个守护进程，用于执行实际的构建。

source: The basic rule behind Gradle's behavior is simple.
zh_cn: Gradle 的行为背后的基本规则是很简单的。

source: The behaviour and properties of an enhanced task is defined by the task's class.
zh_cn: 一个增强型的任务的行为和属性是通过这个任务的类定义的。

source: The build announcements plugin is currently incubating.
zh_cn: 构建公告插件目前仍然是孵化状态。

source: The build announcements plugin uses the announce plugin to send local announcements on important events in the build.
zh_cn: 构建公告插件使用 announce 插件发送构建过程中一些重要事件上的本地公告。

source: The build continues with executing the next task.
zh_cn: 构建会继续执行下一个任务。

source: The build daemon could maintain a process with Groovy and/or Scala already loaded.
zh_cn: 构建守护进程可以维持一个已下载的 Groovy 和 （或） Scala 进程。

source: The build dashboard plugin is currently incubating.
zh_cn: Build Dashboard 插件是目前是孵化中状态。

source: The build is executed from the tropicalFish project.
zh_cn: 这个构建是从tropicalFish项目执行的。

source: The build is executed from the water project.
zh_cn: 这个构建从water项目执行。

source: The build script is executed against the project object that was created during the initialization phase.
zh_cn: 构建脚本会针对在初始化阶段期间创建的 project 对象执行。

source: The build scripts of all projects which are part of the build are executed.
zh_cn: 属于构建的所有 projects 的构建脚本都会被执行。

source: The capability to configure a project build from any build script we call cross project configuration.
zh_cn: 而这种从其他构建脚本配置一个项目构建的能力，我们叫做 交叉项目配置。

source: The classes in the classes dir are analyzed regarding there package dependencies and the packages they expose.
zh_cn: 在classes 目录下的类文件会被分析出关于它们的包的依赖，以及它们所公布的包名。

source: The classifier portion of the archive file name,
zh_cn: 归档文件的名称中的分类部分。

source: The classpath to use when compiling the source files of this source set.
zh_cn: 该类路径在编译该源集的源文件时使用。

source: The classpath to use when executing the classes of this source set.
zh_cn: 该类路径在执行该源集的类时使用。

source: The closure is passed the task as a parameter, and should return true if the task should execute and false if the task should be skipped.
zh_cn: 闭包会作为一个参数传给任务，并且任务应该执行时返回true，或任务应该跳过时返回false。

source: The closure should return a single Task or collection of Task objects, which are then treated as dependencies of the task.
zh_cn: 这个闭包应该返回一个 Task 对象或是Task 对象的集合，返回值会被作为这个任务的依赖项。

source: The closure you pass to the configurations object is applied against its API.
zh_cn: 你传给这个 configurations 对象的闭包会通过它对应的 API 被应用。

source: The command evaluationDependsOn triggers the evaluation of producer before consumer is evaluated.
zh_cn: 命令evaluationDependsOn触发了producer在consumer之前评估。

source: The compile task delegates to Ant's javac task.
zh_cn: compile任务委派了Ant 的 javac 任务。

source: The compile tasks use joint compilation for these directories, which means they can contain a mixture of java and groovy source files.
zh_cn: 这些编译任务对这些目录使用了联合编译，这意味着它们可以同时包含java和groovy源文件。

source: The configuration and execution for multi-project builds is discussed in Chapter 56, Multi-project Builds.
zh_cn: 关于多项目构建的配置与执行，在第 56 章，多项目构建中有论述。

source: The configuration is applied in following order (in case an option is configured in multiple locations the last one wins):
zh_cn: 这些配置将会按以下顺序被应用（以防在多个地方都有配置时只有最后一个 生效）：

source: The configuration is done via a Groovy builder.
zh_cn: 这个配置通过一个 Groovy builder 来完成。

source: The configuration of all projects happens before any task is executed.
zh_cn: 所有项目的配置都发生在任何任务执行之前。

source: The configuration on demand feature is incubating so not every build is guaranteed to work correctly.
zh_cn: 配置需求功能正在孵化中，所以还无法保证每次的构建都能正确。

source: The content of the generated visual studio files can be modified via programmatic hooks, provided by the visualStudio extension.
zh_cn: 通过由visualStudio 提供的编程hook，可以修改所生成的visual studio文件的内容，

source: The conversion process has the following features:
zh_cn: 该转换过程具有以下特点：

source: The copied configuration is in the unresolved state and can be freshly resolved.
zh_cn: 这个复制的配置处于未解析的状态，并且可以被刷新解析。

source: The copied configuration only has orca as a dependency and therefore there is no version conflict and seal-1.0 is returned as a transitive dependency.
zh_cn: 复制的配置只有 orca 一个依赖，因此没有版本冲突，seal-1.0 作为传递依赖被返回。

source: The copy task is very flexible, and allows you to, for example, filter the contents of the files as they are copied, and map to the file names.
zh_cn: 复制任务非常灵活，并允许您进行，比如筛选要复制的文件的内容，或映射文件的名称。

source: The copying methods come in two flavors.
zh_cn: 复制的方法有两种。

source: The core Gradle tool chains are able to target the following architectures out of the box.
zh_cn: 核心 Gradle 工具链针对以下的架构能够开箱即用。

source: The current project is then always build as a single project build.
zh_cn: 那么，当前项目将只会作为单项目构建。

source: The current support for CUnit is quite rudimentary.
zh_cn: 当前对 CUnit 的支持还是相当简陋。

source: The daemon can potentially preemptively download dependencies or check for new versions of snapshot dependencies.
zh_cn: 守护进程可以预先下载依赖项或进行快照依赖的新版本检查。

source: The daemon process automatically expire after 3 hours of idle time.
zh_cn: 守护进程将在空闲3小时后自动失效。

source: The declarative language lies on top of a general purpose task graph, which you can fully leverage in your builds.
zh_cn: 声明性语言位于通用任务图的顶层，你可以在构建中充分发挥。

source: The default evaluation order of the projects is alphanumeric (for the same nesting level).
zh_cn: 默认的项目评估顺序是按字母数字（同一嵌套级别）。

source: The default behavior of the Ear task is to copy the content of src/main/application to the root of the archive.
zh_cn: Ear task 的默认行为是将src/main/application的内容复制到archive 的根目录下。

source: The default behavior of the War task is to copy the content of src/main/webapp to the root of the archive.
zh_cn: War task 的默认行为是将src/main/webapp的内容复制到archive 的根目录下。

source: The default configuration order is top down, which is usually what is needed.
zh_cn: 默认的配置顺序是通常所需要的从顶至下的顺序。

source: The default configuration used by a project dependency on this project.
zh_cn: 本项目上的默认项目依赖配置。

source: The default configuration works well for analyzing standard Java projects and can be customized in many ways.
zh_cn: 默认配置非常适合于分析标准 Java 项目，并可以在许多方面进行自定义。

source: The default is 1, that is, do not execute the tests in parallel.
zh_cn: 它的默认值是 1，也就是说，不并行执行测试。

source: The default is to execute an unlimited number of tests in each test process.
zh_cn: 默认是每个测试进程中执行的测试数量不限。

source: The default name for a generated archive is projectName-version.type For example:
zh_cn: 生成的归档的默认名称是projectName-version.type。举个例子：

source: The default name for archives can be changed with the archivesBaseName project property.
zh_cn: 归档的默认名称可以通过项目属性 archivesBaseName 来更改。

source: The default name for this file is settings.gradle.
zh_cn: 它的默认名称是settings.gradle。

source: The default status scheme, ordered from least to most mature status, is integration, milestone, release.
zh_cn: 默认状态模式，按状态的成熟程度排序，分别是integration、milestone、release。

source: The default value of ignoreFailures is false.
zh_cn: IgnoreFailures的默认值为 false。

source: The defaults are summarized in the tables below.
zh_cn: 下表总结了这些默认值。

source: The dependencies have the following transitive dependencies:
zh_cn: 这些依赖有以下的传递依赖：

source: The dependencies of a client module can be normal module dependencies or artifact dependencies or another client module.
zh_cn: 一个客户端模块的依赖可以是正常的模块依赖，或者是 artifact 依赖项或是另一个客户端模块。

source: The dependency has a version that conflicts with a desired version.
zh_cn: 这个依赖有一个版本与所需要的版本冲突。

source: The dependency is not available in any of remote repositories.
zh_cn: 在任何的远程仓库中这个依赖都不可用。

source: The dependency is not needed for runtime.
zh_cn: 在运行时不需要这个依赖。

source: The dependency is undesired due to licensing reasons.
zh_cn: 由于许可证的原因而让依赖不受欢迎。

source: The dependency reports (see the previous paragraph) are using this API under the covers.
zh_cn: 依赖报告（见前面一段）正是使用此 API。

source: The dependency reports don't show your real dependency graph and the compile task uses all dependencies, not just the first level dependencies.
zh_cn: 依赖报告不会显示你真正的依赖关系图，并且compile任务会使用所有的依赖，而不只是第一级依赖。

source: The desired artifact belongs to a configuration other than default.
zh_cn: 所需的 artifact 属于一个非 default的配置。

source: The details of forking depend on which compiler is used.
zh_cn: fork 的详细情况依赖于所使用的编译器。

source: The developer environment is optimized for speed and feedback so we nearly always run Gradle jobs with the daemon.
zh_cn: 开发人员的环境在速度和反馈上会优化，所以我们几乎总是使用守护进程运行 Gradle 作业。

source: The directory containing the build script.
zh_cn: 包含生成脚本的目录。

source: The directory to generate distributions into.
zh_cn: 要发布的文件将生成到此目录。

source: The directory to generate documentation into.
zh_cn: 要生成文档的目录。

source: The directory to generate libraries into.
zh_cn: 类库将生成到此目录中。

source: The directory to generate reports into.
zh_cn: 报告将生成到此目录。

source: The directory to generate test result .xml files into.
zh_cn: 测试报告的.xml文件将生成到此目录。

source: The directory to generate the archive into
zh_cn: 存放生成的归档文件的目录

source: The directory to generate the classes of this source set into.
zh_cn: 要生成的该源集的类的目录。

source: The directory to generate the project report into.
zh_cn: 生成的项目报告的目录。

source: The directory to generate the resources of this source set into.
zh_cn: 要生成的该源集的资源的目录。

source: The directory to generate the test report into.
zh_cn: 测试报告生成到此目录。

source: The directory to use to cache source dependency information.
zh_cn: 该目录用于缓存源代码的依赖信息。

source: The directory where the generated POMs are written to.
zh_cn: 生成的POM所写入的目录。

source: The distribution contains the JAR file for the library and its dependencies.
zh_cn: 该分发包含了 library 和它的依赖的 JAR 文件。

source: The distribution plugin facilitates building archives that serve as distributions of the project.
zh_cn: 分发插件便于建立archives，作为该项目要分布的文件。

source: The distribution plugin is currently incubating.
zh_cn: 分发插件目前还是孵化中状态。

source: The distribution will package up the runtime dependencies of the application along with some OS specific start scripts.
zh_cn: 分发的内容将会把这个程序的运行时依赖和一些操作系统特定的启动脚本打包在一起。

source: The distribution will package up the runtime dependencies of the library All files stored in src/main/dist will be added to the root of the archive distribution.
zh_cn: distribution 将打包所有的运行时依赖。所有在src/main/dist中存储的文件都将被添加到 archive distribution 根目录中。

source: The example above also demonstrates the mechanism of passing extra command-line arguments to the resource compiler.
zh_cn: 上面的示例还演示了将额外的命令行参数传递给资源编译器的机制。

source: The example above will apply the supplied configuration to all executable binaries built.
zh_cn: 上面的例子将会把提供的配置应用到所有构建的 executable二进制文件。

source: The example is a bit contrived for the sake of showing the mechanism.
zh_cn: 该示例也有点有意展示这个机制。

source: The examples below use closures.
zh_cn: 下面是使用闭包的例子。

source: The examples from the last section were special, as the projects had no Execution Dependencies.
zh_cn: 上一节的例子很特别，因为项目里没有执行依赖。

source: The existing content is merged with the configuration inferred from the Gradle build or defined explicitly in the eclipse DSL
zh_cn: 从 Gradle 构建推断出来或在 eclipse DSL 中显示定义的配置会与现有的内容合并在一起

source: The existing file contents will be used and the explicit configuration in the ear.deploymentDescriptor will be ignored.
zh_cn: 这个已存在的文件的内容将会被使用，而 ear.deploymentDescriptor 里的显示配置则会被忽略。

source: The extension of the archive file name.
zh_cn: 归档文件的名称中的扩展名称部分。

source: The feature should work very well for multi-project builds that have decoupled projects (Section 56.9, “Decoupled Projects”).
zh_cn: 对于解耦的多项目构建，这个功能应该会运行得很好（第 56.9 节，“解耦项目”）。

source: The file is read; or a default version provided by Gradle is used if it does not exist
zh_cn: 读取文件;如果它不存在，则使用由 Gradle 提供的默认版本

source: The files will be created at "$buildDir/distributions/$project.name-$project.version.«ext»".
zh_cn: 这些文件将会创建在“$buildDir/distributions/$project.name-$project.version.«ext»”。

source: The final XML is persisted
zh_cn: 最终的 XML 被持久化

source: The first argument of the instruction call is the key of the property.
zh_cn: instruction 调用的第一个参数是属性的键。

source: The first example for describing such a use case, consists of two webapplication projects and a parent project that creates a distribution out of them.
zh_cn: 第一个例子用于描述这种使用情况，包括两个 webapplication 项目，以及创建了它们的分布情况的父项目。

source: The first layer is the Ant language.
zh_cn: 第一层是 Ant 的语言。

source: The first time you run a build for a project, Gradle creates a .gradle directory in which it puts the compiled script.
zh_cn: 你第一次运行一个项目构建时， Gradle 会创建.gradle目录，用于存放已编译的脚本。

source: The first two tasks are specified by there absolute path, the last task is executed on the name matching mechanism described above.
zh_cn: 前两个任务由它们的绝对路径指定，最后一项任务通过上面所述的匹配机制执行。

source: The first uses auto-delegation to the Project object, for properties not defined in the build script.
zh_cn: 在生成脚本中未定义的属性，第一次使用时自动委托到Project对象。

source: The following diagram shows the relationships between these tasks.
zh_cn: 下图显示了这些任务之间的关系。

source: The following example adds a dependency from taskX to all the tasks in the project whose name starts with lib:
zh_cn: 下面的示例是从taskX加入了项目中所有名称以lib开头的任务的依赖：

source: The following example logs the start and end of each task execution.
zh_cn: 下面的示例展示了在每个任务执行的开始及结束时打印日志。

source: The following example removes all existing dependencies from the Classpath domain object:
zh_cn: 下面的示例从Classpath域对象中删除现有的所有依赖关系:

source: The following example removes all existing dependencies from the Module domain object:
zh_cn: 下面的示例从Module域对象中删除现有的所有依赖关系:

source: The following example sets the srcDir property of each task as it is created.
zh_cn: 下面的示例是在每个任务创建之前设置srcDir属性。

source: The following examples show several different ways to achieve the same configuration.
zh_cn: 下面的示例演示了几种不同的方式来实现相同的配置。

source: The following notification systems are supported:
zh_cn: 支持以下通知系统：

source: The following properties can alternatively be set from the command line, as task parameters of the sonarAnalyze task.
zh_cn: 下面的属性或者可以从命令行中或者是作为sonarAnalyze任务的任务参数这两种方式之一来设置。

source: The following properties can be used to configure the Gradle build environment:
zh_cn: 下面的属性可以用于配置 Gradle 构建环境：

source: The following table lists a few of the commonly used ones.
zh_cn: 下表列出了常用的几个属性。

source: The following table lists some of the important properties of a source set.
zh_cn: 下表列出了一些重要的源集属性。

source: The following table lists supported notification services and their configuration properties.
zh_cn: 下表列出了支持的通知服务以及它们的配置属性。

source: The following table lists the domain object used for each of the Eclipse model types:
zh_cn: 下表列出了用于每个 Eclipse 模型类型的域对象：

source: The following table lists the domain object used for each of the model types:
zh_cn: 下表列出了用于每个模型类型的域对象：

source: The following tool chains are supported:
zh_cn: 支持以下的工具链：

source: The former is used to locate classes referenced by the source code, and will typically contain scala-library along with other libraries.
zh_cn: 前者用于在源代码中查找类的引用，通常会包含 scala-library和其他库。

source: The former is used to locate classes referenced by the source code, and will typically contain the Groovy library along with other libraries.
zh_cn: 前者用于在源代码中查找类的引用，通常会包含 Groovy 库和其他库。

source: The full stacktraces are printed out.
zh_cn: 打印全部的栈跟踪信息。

source: The generated test results will be located in the ${build.dir}/test-results directory.
zh_cn: 生成的测试结果将位于${build.dir}/test-results目录。

source: The generation lifecycle is as follows:
zh_cn: 生成的生命周期如下:
